## Pandas Assignment 1

### --------------------------------------------------------------------

In [3]:
import pandas as pd

#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
s = pd.Series([4,8,15,23,42])

In [6]:
print(s)
print(type(s))

0     4
1     8
2    15
3    23
4    42
dtype: int64
<class 'pandas.core.series.Series'>

### --------------------------------------------------------------------

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#### variable print it.

In [7]:
ls = [i**2 for i in range(10)]

In [36]:
print(pd.Series(ls))

0     0
1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

### --------------------------------------------------------------------

#### Q3. Create a Pandas DataFrame that contains the following data:

In [10]:
data = {'Name':['Alice','Bob','Claire'] ,'Age':[25,30,27] ,'Gender':['Female','Male','Female']}

In [33]:
df = pd.DataFrame(data)

In [35]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### --------------------------------------------------------------------

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans -> In Pandas, a DataFrame is a two-dimensional table-like data structure consisting of rows and columns, similar to a spreadsheet or SQL table. Each column in a DataFrame can be of a different data type (e.g. integer, float, string, etc.). DataFrames are a fundamental data structure in Pandas and are commonly used for data manipulation and analysis.

On the other hand, a Pandas Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating-point numbers, Python objects, etc.). The axis labels of a Series are collectively referred to as its index. Series are often used to represent a single column of data from a DataFrame or a single variable in a statistical model.

In [16]:
##Example for Dataframe
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [21]:
#Example of Series
print(df['Name'])
print(type(df['Name']))

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

### --------------------------------------------------------------------

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#### you give an example of when you might use one of these functions?

Ans -> Some of the common functions for data manipulation in a dataframe are:

 - .columns
 
 To get all the columns headers name
 - .head() and .tail()
 
 To get first 5 or last 5 records(or any number of record depending on passed paremeter
 
 - .dtypes
 
 To get data types of all the columns
 
 - .to_csv('doc.csv')
 
 To import a csv file to local system
 
 - .describe() 
 
 To get all the mathematical details of all numeric columns
 
 - len(df)
 
 To get number of records in a dataframe
 
 - .iloc[] and .loc[]
 
 To get selected record and selected columns
 
 - .drop('column_name'/row_index,inplac = True)
 
 To delete a row (axis = 0) or a column (axis = 1)
 
 - .set_index('column_name') and .reset_index
 
 To set a column as index and to reset to inbuilt indexing
 
 - .applymap(func)
 
 To apply some fuction on all the values in a dataframe
 
 - .T
 
 To Transpose
 
 - .dropna() and fillna()
 
 To remove a row(axis = 0) or column(axis =1) containg NA entery or fill it up with some value
 
 - .groupby()
 
 To group data and get results based on category
 
 - pd.concat([df1 ,df2]

 To concatenate two dataframes either horizontally or vertically
 
 - pd.merge(df1,df2) or pd.join(df1,df2)
 
 To merge(based on primarykey) or join(based on index value) two data frame with options like how = left,right,outer,cross
 
 - .iterrows() or .iteritems()
 
 To iterate a dataframe based on index or column

In [22]:
#Example

df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [23]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
df.loc[1:7 ,['Name','Age','Survived']]

                                                Name   Age  Survived
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0         1
2                             Heikkinen, Miss. Laina  26.0         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0         1
4                           Allen, Mr. William Henry  35.0         0
5                                   Moran, Mr. James   NaN         0
6                            McCarthy, Mr. Timothy J  54.0         0
7                     Palsson, Master. Gosta Leonard   2.0         0

### --------------------------------------------------------------------

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans -> 
- Series – 1D labeled homogeneous array, sizeimmutable,valuemutable
- Data Frames – 2D labeled, size&data mutable tabular structure with heterogenic columns
- Panel – 3D labeled size mutable array.

So DataFrame and Panel are mutable , but series is only value mutable but not sizemutable.

### --------------------------------------------------------------------

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [28]:
s1 = pd.Series(['Aryav','Vivek','Abhinav','Nayan'])
s2 = pd.Series([23 , 24 , 27 , 15])
s3 = pd.Series(['XI','IX','X','XII'])

In [30]:
df1 = pd.DataFrame({'Name':s1 , 'Age':s2 , 'Class':s3})

In [31]:
df1

      Name  Age Class
0    Aryav   23    XI
1    Vivek   24    IX
2  Abhinav   27     X
3    Nayan   15   XII